Управление_пожарной_частью_/src/Documents/ВыдачаВещевогоИмущества/ВыдачаВещевогоИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаВещевогоИмущества</name>
  <registerRecords>AccumulationRegister.НоменклатураСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.НоменклатураНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланДатаСписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/ВыдачаВещевогоИмущества/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ВещевоеИмуществоНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	Возврат Объект.Дата + Номенклатура.СрокИспользования * 86400;
	
КонецФункции

&НаКлиенте
Процедура ОбновлениеСпискаДоступныхСроковИспользования(Элемент)
	
	ТекущиеДанные = Элементы.ВещевоеИмущетво.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ПланДатаСписания = ВещевоеИмуществоНоменклатураПриИзмененииНаСервере(ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.Основная");
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		ИмяПользователя = ИмяПользователя();
		
		НайденныйСотрудник = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
		
		Если ЗначениеЗаполнено(НайденныйСотрудник) Тогда
			Объект.Ответственный = НайденныйСотрудник;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
